grevaillot/svd_tools/headers/STM32H753x/cryp.h
/** @defgroup cryp_k0lr K0LR key registers
@{*/

/** CRYP_K0LR_K255 K255 **/
#define CRYP_K0LR_K255		(1 << 31)
/** CRYP_K0LR_K254 K254 **/
#define CRYP_K0LR_K254		(1 << 30)
/** CRYP_K0LR_K253 K253 **/
#define CRYP_K0LR_K253		(1 << 29)
/** CRYP_K0LR_K252 K252 **/
#define CRYP_K0LR_K252		(1 << 28)
/** CRYP_K0LR_K251 K251 **/
#define CRYP_K0LR_K251		(1 << 27)
/** CRYP_K0LR_K250 K250 **/
#define CRYP_K0LR_K250		(1 << 26)
/** CRYP_K0LR_K249 K249 **/
#define CRYP_K0LR_K249		(1 << 25)
/** CRYP_K0LR_K248 K248 **/
#define CRYP_K0LR_K248		(1 << 24)
/** CRYP_K0LR_K247 K247 **/
#define CRYP_K0LR_K247		(1 << 23)
/** CRYP_K0LR_K246 K246 **/
#define CRYP_K0LR_K246		(1 << 22)
/** CRYP_K0LR_K245 K245 **/
#define CRYP_K0LR_K245		(1 << 21)
/** CRYP_K0LR_K244 K244 **/
#define CRYP_K0LR_K244		(1 << 20)
/** CRYP_K0LR_K243 K243 **/
#define CRYP_K0LR_K243		(1 << 19)
/** CRYP_K0LR_K242 K242 **/
#define CRYP_K0LR_K242		(1 << 18)
/** CRYP_K0LR_K241 K241 **/
#define CRYP_K0LR_K241		(1 << 17)
/** CRYP_K0LR_K240 K240 **/
#define CRYP_K0LR_K240		(1 << 16)
/** CRYP_K0LR_K239 K239 **/
#define CRYP_K0LR_K239		(1 << 15)
/** CRYP_K0LR_K238 K238 **/
#define CRYP_K0LR_K238		(1 << 14)
/** CRYP_K0LR_K237 K237 **/
#define CRYP_K0LR_K237		(1 << 13)
/** CRYP_K0LR_K236 K236 **/
#define CRYP_K0LR_K236		(1 << 12)
/** CRYP_K0LR_K235 K235 **/
#define CRYP_K0LR_K235		(1 << 11)
/** CRYP_K0LR_K234 K234 **/
#define CRYP_K0LR_K234		(1 << 10)
/** CRYP_K0LR_K233 K233 **/
#define CRYP_K0LR_K233		(1 << 9)
/** CRYP_K0LR_K232 K232 **/
#define CRYP_K0LR_K232		(1 << 8)
/** CRYP_K0LR_K231 K231 **/
#define CRYP_K0LR_K231		(1 << 7)
/** CRYP_K0LR_K230 K230 **/
#define CRYP_K0LR_K230		(1 << 6)
/** CRYP_K0LR_K229 K229 **/
#define CRYP_K0LR_K229		(1 << 5)
/** CRYP_K0LR_K228 K228 **/
#define CRYP_K0LR_K228		(1 << 4)
/** CRYP_K0LR_K227 K227 **/
#define CRYP_K0LR_K227		(1 << 3)
/** CRYP_K0LR_K226 K226 **/
#define CRYP_K0LR_K226		(1 << 2)
/** CRYP_K0LR_K225 K225 **/
#define CRYP_K0LR_K225		(1 << 1)
/** CRYP_K0LR_K224 K224 **/
#define CRYP_K0LR_K224		(1 << 0)

/**@}*/

/** @defgroup cryp_k0rr K0RR key registers
@{*/

/** CRYP_K0RR_K223 K223 **/
#define CRYP_K0RR_K223		(1 << 31)
/** CRYP_K0RR_K222 K222 **/
#define CRYP_K0RR_K222		(1 << 30)
/** CRYP_K0RR_K221 K221 **/
#define CRYP_K0RR_K221		(1 << 29)
/** CRYP_K0RR_K220 K220 **/
#define CRYP_K0RR_K220		(1 << 28)
/** CRYP_K0RR_K219 K219 **/
#define CRYP_K0RR_K219		(1 << 27)
/** CRYP_K0RR_K218 K218 **/
#define CRYP_K0RR_K218		(1 << 26)
/** CRYP_K0RR_K217 K217 **/
#define CRYP_K0RR_K217		(1 << 25)
/** CRYP_K0RR_K216 K216 **/
#define CRYP_K0RR_K216		(1 << 24)
/** CRYP_K0RR_K215 K215 **/
#define CRYP_K0RR_K215		(1 << 23)
/** CRYP_K0RR_K214 K214 **/
#define CRYP_K0RR_K214		(1 << 22)
/** CRYP_K0RR_K213 K213 **/
#define CRYP_K0RR_K213		(1 << 21)
/** CRYP_K0RR_K212 K212 **/
#define CRYP_K0RR_K212		(1 << 20)
/** CRYP_K0RR_K211 K211 **/
#define CRYP_K0RR_K211		(1 << 19)
/** CRYP_K0RR_K210 K210 **/
#define CRYP_K0RR_K210		(1 << 18)
/** CRYP_K0RR_K209 K209 **/
#define CRYP_K0RR_K209		(1 << 17)
/** CRYP_K0RR_K208 K208 **/
#define CRYP_K0RR_K208		(1 << 16)
/** CRYP_K0RR_K207 K207 **/
#define CRYP_K0RR_K207		(1 << 15)
/** CRYP_K0RR_K206 K206 **/
#define CRYP_K0RR_K206		(1 << 14)
/** CRYP_K0RR_K205 K205 **/
#define CRYP_K0RR_K205		(1 << 13)
/** CRYP_K0RR_K204 K204 **/
#define CRYP_K0RR_K204		(1 << 12)
/** CRYP_K0RR_K203 K203 **/
#define CRYP_K0RR_K203		(1 << 11)
/** CRYP_K0RR_K202 K202 **/
#define CRYP_K0RR_K202		(1 << 10)
/** CRYP_K0RR_K201 K201 **/
#define CRYP_K0RR_K201		(1 << 9)
/** CRYP_K0RR_K200 K200 **/
#define CRYP_K0RR_K200		(1 << 8)
/** CRYP_K0RR_K199 K199 **/
#define CRYP_K0RR_K199		(1 << 7)
/** CRYP_K0RR_K198 K198 **/
#define CRYP_K0RR_K198		(1 << 6)
/** CRYP_K0RR_K197 K197 **/
#define CRYP_K0RR_K197		(1 << 5)
/** CRYP_K0RR_K196 K196 **/
#define CRYP_K0RR_K196		(1 << 4)
/** CRYP_K0RR_K195 K195 **/
#define CRYP_K0RR_K195		(1 << 3)
/** CRYP_K0RR_K194 K194 **/
#define CRYP_K0RR_K194		(1 << 2)
/** CRYP_K0RR_K193 K193 **/
#define CRYP_K0RR_K193		(1 << 1)
/** CRYP_K0RR_K192 K192 **/
#define CRYP_K0RR_K192		(1 << 0)

/**@}*/

/** @defgroup cryp_k1lr K1LR key registers
@{*/

/** CRYP_K1LR_K191 K191 **/
#define CRYP_K1LR_K191		(1 << 31)
/** CRYP_K1LR_K190 K190 **/
#define CRYP_K1LR_K190		(1 << 30)
/** CRYP_K1LR_K189 K189 **/
#define CRYP_K1LR_K189		(1 << 29)
/** CRYP_K1LR_K188 K188 **/
#define CRYP_K1LR_K188		(1 << 28)
/** CRYP_K1LR_K187 K187 **/
#define CRYP_K1LR_K187		(1 << 27)
/** CRYP_K1LR_K186 K186 **/
#define CRYP_K1LR_K186		(1 << 26)
/** CRYP_K1LR_K185 K185 **/
#define CRYP_K1LR_K185		(1 << 25)
/** CRYP_K1LR_K184 K184 **/
#define CRYP_K1LR_K184		(1 << 24)
/** CRYP_K1LR_K183 K183 **/
#define CRYP_K1LR_K183		(1 << 23)
/** CRYP_K1LR_K182 K182 **/
#define CRYP_K1LR_K182		(1 << 22)
/** CRYP_K1LR_K181 K181 **/
#define CRYP_K1LR_K181		(1 << 21)
/** CRYP_K1LR_K180 K180 **/
#define CRYP_K1LR_K180		(1 << 20)
/** CRYP_K1LR_K179 K179 **/
#define CRYP_K1LR_K179		(1 << 19)
/** CRYP_K1LR_K178 K178 **/
#define CRYP_K1LR_K178		(1 << 18)
/** CRYP_K1LR_K177 K177 **/
#define CRYP_K1LR_K177		(1 << 17)
/** CRYP_K1LR_K176 K176 **/
#define CRYP_K1LR_K176		(1 << 16)
/** CRYP_K1LR_K175 K175 **/
#define CRYP_K1LR_K175		(1 << 15)
/** CRYP_K1LR_K174 K174 **/
#define CRYP_K1LR_K174		(1 << 14)
/** CRYP_K1LR_K173 K173 **/
#define CRYP_K1LR_K173		(1 << 13)
/** CRYP_K1LR_K172 K172 **/
#define CRYP_K1LR_K172		(1 << 12)
/** CRYP_K1LR_K171 K171 **/
#define CRYP_K1LR_K171		(1 << 11)
/** CRYP_K1LR_K170 K170 **/
#define CRYP_K1LR_K170		(1 << 10)
/** CRYP_K1LR_K169 K169 **/
#define CRYP_K1LR_K169		(1 << 9)
/** CRYP_K1LR_K168 K168 **/
#define CRYP_K1LR_K168		(1 << 8)
/** CRYP_K1LR_K167 K167 **/
#define CRYP_K1LR_K167		(1 << 7)
/** CRYP_K1LR_K166 K166 **/
#define CRYP_K1LR_K166		(1 << 6)
/** CRYP_K1LR_K165 K165 **/
#define CRYP_K1LR_K165		(1 << 5)
/** CRYP_K1LR_K164 K164 **/
#define CRYP_K1LR_K164		(1 << 4)
/** CRYP_K1LR_K163 K163 **/
#define CRYP_K1LR_K163		(1 << 3)
/** CRYP_K1LR_K162 K162 **/
#define CRYP_K1LR_K162		(1 << 2)
/** CRYP_K1LR_K161 K161 **/
#define CRYP_K1LR_K161		(1 << 1)
/** CRYP_K1LR_K160 K160 **/
#define CRYP_K1LR_K160		(1 << 0)

/**@}*/

/** @defgroup cryp_k1rr K1RR key registers
@{*/

/** CRYP_K1RR_K159 K159 **/
#define CRYP_K1RR_K159		(1 << 31)
/** CRYP_K1RR_K158 K158 **/
#define CRYP_K1RR_K158		(1 << 30)
/** CRYP_K1RR_K157 K157 **/
#define CRYP_K1RR_K157		(1 << 29)
/** CRYP_K1RR_K156 K156 **/
#define CRYP_K1RR_K156		(1 << 28)
/** CRYP_K1RR_K155 K155 **/
#define CRYP_K1RR_K155		(1 << 27)
/** CRYP_K1RR_K154 K154 **/
#define CRYP_K1RR_K154		(1 << 26)
/** CRYP_K1RR_K153 K153 **/
#define CRYP_K1RR_K153		(1 << 25)
/** CRYP_K1RR_K152 K152 **/
#define CRYP_K1RR_K152		(1 << 24)
/** CRYP_K1RR_K151 K151 **/
#define CRYP_K1RR_K151		(1 << 23)
/** CRYP_K1RR_K150 K150 **/
#define CRYP_K1RR_K150		(1 << 22)
/** CRYP_K1RR_K149 K149 **/
#define CRYP_K1RR_K149		(1 << 21)
/** CRYP_K1RR_K148 K148 **/
#define CRYP_K1RR_K148		(1 << 20)
/** CRYP_K1RR_K147 K147 **/
#define CRYP_K1RR_K147		(1 << 19)
/** CRYP_K1RR_K146 K146 **/
#define CRYP_K1RR_K146		(1 << 18)
/** CRYP_K1RR_K145 K145 **/
#define CRYP_K1RR_K145		(1 << 17)
/** CRYP_K1RR_K144 K144 **/
#define CRYP_K1RR_K144		(1 << 16)
/** CRYP_K1RR_K143 K143 **/
#define CRYP_K1RR_K143		(1 << 15)
/** CRYP_K1RR_K142 K142 **/
#define CRYP_K1RR_K142		(1 << 14)
/** CRYP_K1RR_K141 K141 **/
#define CRYP_K1RR_K141		(1 << 13)
/** CRYP_K1RR_K140 K140 **/
#define CRYP_K1RR_K140		(1 << 12)
/** CRYP_K1RR_K139 K139 **/
#define CRYP_K1RR_K139		(1 << 11)
/** CRYP_K1RR_K138 K138 **/
#define CRYP_K1RR_K138		(1 << 10)
/** CRYP_K1RR_K137 K137 **/
#define CRYP_K1RR_K137		(1 << 9)
/** CRYP_K1RR_K136 K136 **/
#define CRYP_K1RR_K136		(1 << 8)
/** CRYP_K1RR_K135 K135 **/
#define CRYP_K1RR_K135		(1 << 7)
/** CRYP_K1RR_K134 K134 **/
#define CRYP_K1RR_K134		(1 << 6)
/** CRYP_K1RR_K133 K133 **/
#define CRYP_K1RR_K133		(1 << 5)
/** CRYP_K1RR_K132 K132 **/
#define CRYP_K1RR_K132		(1 << 4)
/** CRYP_K1RR_K131 K131 **/
#define CRYP_K1RR_K131		(1 << 3)
/** CRYP_K1RR_K130 K130 **/
#define CRYP_K1RR_K130		(1 << 2)
/** CRYP_K1RR_K129 K129 **/
#define CRYP_K1RR_K129		(1 << 1)
/** CRYP_K1RR_K128 K128 **/
#define CRYP_K1RR_K128		(1 << 0)

/**@}*/

/** @defgroup cryp_k2lr K2LR key registers
@{*/

/** CRYP_K2LR_K127 K127 **/
#define CRYP_K2LR_K127		(1 << 31)
/** CRYP_K2LR_K126 K126 **/
#define CRYP_K2LR_K126		(1 << 30)
/** CRYP_K2LR_K125 K125 **/
#define CRYP_K2LR_K125		(1 << 29)
/** CRYP_K2LR_K124 K124 **/
#define CRYP_K2LR_K124		(1 << 28)
/** CRYP_K2LR_K123 K123 **/
#define CRYP_K2LR_K123		(1 << 27)
/** CRYP_K2LR_K122 K122 **/
#define CRYP_K2LR_K122		(1 << 26)
/** CRYP_K2LR_K121 K121 **/
#define CRYP_K2LR_K121		(1 << 25)
/** CRYP_K2LR_K120 K120 **/
#define CRYP_K2LR_K120		(1 << 24)
/** CRYP_K2LR_K119 K119 **/
#define CRYP_K2LR_K119		(1 << 23)
/** CRYP_K2LR_K118 K118 **/
#define CRYP_K2LR_K118		(1 << 22)
/** CRYP_K2LR_K117 K117 **/
#define CRYP_K2LR_K117		(1 << 21)
/** CRYP_K2LR_K116 K116 **/
#define CRYP_K2LR_K116		(1 << 20)
/** CRYP_K2LR_K115 K115 **/
#define CRYP_K2LR_K115		(1 << 19)
/** CRYP_K2LR_K114 K114 **/
#define CRYP_K2LR_K114		(1 << 18)
/** CRYP_K2LR_K113 K113 **/
#define CRYP_K2LR_K113		(1 << 17)
/** CRYP_K2LR_K112 K112 **/
#define CRYP_K2LR_K112		(1 << 16)
/** CRYP_K2LR_K111 K111 **/
#define CRYP_K2LR_K111		(1 << 15)
/** CRYP_K2LR_K110 K110 **/
#define CRYP_K2LR_K110		(1 << 14)
/** CRYP_K2LR_K109 K109 **/
#define CRYP_K2LR_K109		(1 << 13)
/** CRYP_K2LR_K108 K108 **/
#define CRYP_K2LR_K108		(1 << 12)
/** CRYP_K2LR_K107 K107 **/
#define CRYP_K2LR_K107		(1 << 11)
/** CRYP_K2LR_K106 K106 **/
#define CRYP_K2LR_K106		(1 << 10)
/** CRYP_K2LR_K105 K105 **/
#define CRYP_K2LR_K105		(1 << 9)
/** CRYP_K2LR_K104 K104 **/
#define CRYP_K2LR_K104		(1 << 8)
/** CRYP_K2LR_K103 K103 **/
#define CRYP_K2LR_K103		(1 << 7)
/** CRYP_K2LR_K102 K102 **/
#define CRYP_K2LR_K102		(1 << 6)
/** CRYP_K2LR_K101 K101 **/
#define CRYP_K2LR_K101		(1 << 5)
/** CRYP_K2LR_K100 K100 **/
#define CRYP_K2LR_K100		(1 << 4)
/** CRYP_K2LR_K99 K99 **/
#define CRYP_K2LR_K99		(1 << 3)
/** CRYP_K2LR_K98 K98 **/
#define CRYP_K2LR_K98		(1 << 2)
/** CRYP_K2LR_K97 K97 **/
#define CRYP_K2LR_K97		(1 << 1)
/** CRYP_K2LR_K96 K96 **/
#define CRYP_K2LR_K96		(1 << 0)

/**@}*/

/** @defgroup cryp_k2rr K2RR key registers
@{*/

/** CRYP_K2RR_K95 K95 **/
#define CRYP_K2RR_K95		(1 << 31)
/** CRYP_K2RR_K94 K94 **/
#define CRYP_K2RR_K94		(1 << 30)
/** CRYP_K2RR_K93 K93 **/
#define CRYP_K2RR_K93		(1 << 29)
/** CRYP_K2RR_K92 K92 **/
#define CRYP_K2RR_K92		(1 << 28)
/** CRYP_K2RR_K91 K91 **/
#define CRYP_K2RR_K91		(1 << 27)
/** CRYP_K2RR_K90 K90 **/
#define CRYP_K2RR_K90		(1 << 26)
/** CRYP_K2RR_K89 K89 **/
#define CRYP_K2RR_K89		(1 << 25)
/** CRYP_K2RR_K88 K88 **/
#define CRYP_K2RR_K88		(1 << 24)
/** CRYP_K2RR_K87 K87 **/
#define CRYP_K2RR_K87		(1 << 23)
/** CRYP_K2RR_K86 K86 **/
#define CRYP_K2RR_K86		(1 << 22)
/** CRYP_K2RR_K85 K85 **/
#define CRYP_K2RR_K85		(1 << 21)
/** CRYP_K2RR_K84 K84 **/
#define CRYP_K2RR_K84		(1 << 20)
/** CRYP_K2RR_K83 K83 **/
#define CRYP_K2RR_K83		(1 << 19)
/** CRYP_K2RR_K82 K82 **/
#define CRYP_K2RR_K82		(1 << 18)
/** CRYP_K2RR_K81 K81 **/
#define CRYP_K2RR_K81		(1 << 17)
/** CRYP_K2RR_K80 K80 **/
#define CRYP_K2RR_K80		(1 << 16)
/** CRYP_K2RR_K79 K79 **/
#define CRYP_K2RR_K79		(1 << 15)
/** CRYP_K2RR_K78 K78 **/
#define CRYP_K2RR_K78		(1 << 14)
/** CRYP_K2RR_K77 K77 **/
#define CRYP_K2RR_K77		(1 << 13)
/** CRYP_K2RR_K76 K76 **/
#define CRYP_K2RR_K76		(1 << 12)
/** CRYP_K2RR_K75 K75 **/
#define CRYP_K2RR_K75		(1 << 11)
/** CRYP_K2RR_K74 K74 **/
#define CRYP_K2RR_K74		(1 << 10)
/** CRYP_K2RR_K73 K73 **/
#define CRYP_K2RR_K73		(1 << 9)
/** CRYP_K2RR_K72 K72 **/
#define CRYP_K2RR_K72		(1 << 8)
/** CRYP_K2RR_K71 K71 **/
#define CRYP_K2RR_K71		(1 << 7)
/** CRYP_K2RR_K70 K70 **/
#define CRYP_K2RR_K70		(1 << 6)
/** CRYP_K2RR_K69 K69 **/
#define CRYP_K2RR_K69		(1 << 5)
/** CRYP_K2RR_K68 K68 **/
#define CRYP_K2RR_K68		(1 << 4)
/** CRYP_K2RR_K67 K67 **/
#define CRYP_K2RR_K67		(1 << 3)
/** CRYP_K2RR_K66 K66 **/
#define CRYP_K2RR_K66		(1 << 2)
/** CRYP_K2RR_K65 K65 **/
#define CRYP_K2RR_K65		(1 << 1)
/** CRYP_K2RR_K64 K64 **/
#define CRYP_K2RR_K64		(1 << 0)

/**@}*/

