grevaillot/svd_tools/headers/STM32H753x/cryp.h
/** @defgroup cryp_k3lr K3LR key registers
@{*/

/** CRYP_K3LR_K63 K63 **/
#define CRYP_K3LR_K63		(1 << 31)
/** CRYP_K3LR_K62 K62 **/
#define CRYP_K3LR_K62		(1 << 30)
/** CRYP_K3LR_K61 K61 **/
#define CRYP_K3LR_K61		(1 << 29)
/** CRYP_K3LR_K60 K60 **/
#define CRYP_K3LR_K60		(1 << 28)
/** CRYP_K3LR_K59 K59 **/
#define CRYP_K3LR_K59		(1 << 27)
/** CRYP_K3LR_K58 K58 **/
#define CRYP_K3LR_K58		(1 << 26)
/** CRYP_K3LR_K57 K57 **/
#define CRYP_K3LR_K57		(1 << 25)
/** CRYP_K3LR_K56 K56 **/
#define CRYP_K3LR_K56		(1 << 24)
/** CRYP_K3LR_K55 K55 **/
#define CRYP_K3LR_K55		(1 << 23)
/** CRYP_K3LR_K54 K54 **/
#define CRYP_K3LR_K54		(1 << 22)
/** CRYP_K3LR_K53 K53 **/
#define CRYP_K3LR_K53		(1 << 21)
/** CRYP_K3LR_K52 K52 **/
#define CRYP_K3LR_K52		(1 << 20)
/** CRYP_K3LR_K51 K51 **/
#define CRYP_K3LR_K51		(1 << 19)
/** CRYP_K3LR_K50 K50 **/
#define CRYP_K3LR_K50		(1 << 18)
/** CRYP_K3LR_K49 K49 **/
#define CRYP_K3LR_K49		(1 << 17)
/** CRYP_K3LR_K48 K48 **/
#define CRYP_K3LR_K48		(1 << 16)
/** CRYP_K3LR_K47 K47 **/
#define CRYP_K3LR_K47		(1 << 15)
/** CRYP_K3LR_K46 K46 **/
#define CRYP_K3LR_K46		(1 << 14)
/** CRYP_K3LR_K45 K45 **/
#define CRYP_K3LR_K45		(1 << 13)
/** CRYP_K3LR_K44 K44 **/
#define CRYP_K3LR_K44		(1 << 12)
/** CRYP_K3LR_K43 K43 **/
#define CRYP_K3LR_K43		(1 << 11)
/** CRYP_K3LR_K42 K42 **/
#define CRYP_K3LR_K42		(1 << 10)
/** CRYP_K3LR_K41 K41 **/
#define CRYP_K3LR_K41		(1 << 9)
/** CRYP_K3LR_K40 K40 **/
#define CRYP_K3LR_K40		(1 << 8)
/** CRYP_K3LR_K39 K39 **/
#define CRYP_K3LR_K39		(1 << 7)
/** CRYP_K3LR_K38 K38 **/
#define CRYP_K3LR_K38		(1 << 6)
/** CRYP_K3LR_K37 K37 **/
#define CRYP_K3LR_K37		(1 << 5)
/** CRYP_K3LR_K36 K36 **/
#define CRYP_K3LR_K36		(1 << 4)
/** CRYP_K3LR_K35 K35 **/
#define CRYP_K3LR_K35		(1 << 3)
/** CRYP_K3LR_K34 K34 **/
#define CRYP_K3LR_K34		(1 << 2)
/** CRYP_K3LR_K33 K33 **/
#define CRYP_K3LR_K33		(1 << 1)
/** CRYP_K3LR_K32 K32 **/
#define CRYP_K3LR_K32		(1 << 0)

/**@}*/

/** @defgroup cryp_k3rr K3RR key registers
@{*/

/** CRYP_K3RR_K31 K31 **/
#define CRYP_K3RR_K31		(1 << 31)
/** CRYP_K3RR_K30 K30 **/
#define CRYP_K3RR_K30		(1 << 30)
/** CRYP_K3RR_K29 K29 **/
#define CRYP_K3RR_K29		(1 << 29)
/** CRYP_K3RR_K28 K28 **/
#define CRYP_K3RR_K28		(1 << 28)
/** CRYP_K3RR_K27 K27 **/
#define CRYP_K3RR_K27		(1 << 27)
/** CRYP_K3RR_K26 K26 **/
#define CRYP_K3RR_K26		(1 << 26)
/** CRYP_K3RR_K25 K25 **/
#define CRYP_K3RR_K25		(1 << 25)
/** CRYP_K3RR_K24 K24 **/
#define CRYP_K3RR_K24		(1 << 24)
/** CRYP_K3RR_K23 K23 **/
#define CRYP_K3RR_K23		(1 << 23)
/** CRYP_K3RR_K22 K22 **/
#define CRYP_K3RR_K22		(1 << 22)
/** CRYP_K3RR_K21 K21 **/
#define CRYP_K3RR_K21		(1 << 21)
/** CRYP_K3RR_K20 K20 **/
#define CRYP_K3RR_K20		(1 << 20)
/** CRYP_K3RR_K19 K19 **/
#define CRYP_K3RR_K19		(1 << 19)
/** CRYP_K3RR_K18 K18 **/
#define CRYP_K3RR_K18		(1 << 18)
/** CRYP_K3RR_K17 K17 **/
#define CRYP_K3RR_K17		(1 << 17)
/** CRYP_K3RR_K16 K16 **/
#define CRYP_K3RR_K16		(1 << 16)
/** CRYP_K3RR_K15 K15 **/
#define CRYP_K3RR_K15		(1 << 15)
/** CRYP_K3RR_K14 K14 **/
#define CRYP_K3RR_K14		(1 << 14)
/** CRYP_K3RR_K13 K13 **/
#define CRYP_K3RR_K13		(1 << 13)
/** CRYP_K3RR_K12 K12 **/
#define CRYP_K3RR_K12		(1 << 12)
/** CRYP_K3RR_K11 K11 **/
#define CRYP_K3RR_K11		(1 << 11)
/** CRYP_K3RR_K10 K10 **/
#define CRYP_K3RR_K10		(1 << 10)
/** CRYP_K3RR_K9 K9 **/
#define CRYP_K3RR_K9		(1 << 9)
/** CRYP_K3RR_K8 K8 **/
#define CRYP_K3RR_K8		(1 << 8)
/** CRYP_K3RR_K7 K7 **/
#define CRYP_K3RR_K7		(1 << 7)
/** CRYP_K3RR_K6 K6 **/
#define CRYP_K3RR_K6		(1 << 6)
/** CRYP_K3RR_K5 K5 **/
#define CRYP_K3RR_K5		(1 << 5)
/** CRYP_K3RR_K4 K4 **/
#define CRYP_K3RR_K4		(1 << 4)
/** CRYP_K3RR_K3 K3 **/
#define CRYP_K3RR_K3		(1 << 3)
/** CRYP_K3RR_K2 K2 **/
#define CRYP_K3RR_K2		(1 << 2)
/** CRYP_K3RR_K1 K1 **/
#define CRYP_K3RR_K1		(1 << 1)
/** CRYP_K3RR_K0 K0 **/
#define CRYP_K3RR_K0		(1 << 0)

/**@}*/

/** @defgroup cryp_iv0lr IV0LR initialization vector registers
@{*/

/** CRYP_IV0LR_IV0 IV0 **/
#define CRYP_IV0LR_IV0		(1 << 31)
/** CRYP_IV0LR_IV1 IV1 **/
#define CRYP_IV0LR_IV1		(1 << 30)
/** CRYP_IV0LR_IV2 IV2 **/
#define CRYP_IV0LR_IV2		(1 << 29)
/** CRYP_IV0LR_IV3 IV3 **/
#define CRYP_IV0LR_IV3		(1 << 28)
/** CRYP_IV0LR_IV4 IV4 **/
#define CRYP_IV0LR_IV4		(1 << 27)
/** CRYP_IV0LR_IV5 IV5 **/
#define CRYP_IV0LR_IV5		(1 << 26)
/** CRYP_IV0LR_IV6 IV6 **/
#define CRYP_IV0LR_IV6		(1 << 25)
/** CRYP_IV0LR_IV7 IV7 **/
#define CRYP_IV0LR_IV7		(1 << 24)
/** CRYP_IV0LR_IV8 IV8 **/
#define CRYP_IV0LR_IV8		(1 << 23)
/** CRYP_IV0LR_IV9 IV9 **/
#define CRYP_IV0LR_IV9		(1 << 22)
/** CRYP_IV0LR_IV10 IV10 **/
#define CRYP_IV0LR_IV10		(1 << 21)
/** CRYP_IV0LR_IV11 IV11 **/
#define CRYP_IV0LR_IV11		(1 << 20)
/** CRYP_IV0LR_IV12 IV12 **/
#define CRYP_IV0LR_IV12		(1 << 19)
/** CRYP_IV0LR_IV13 IV13 **/
#define CRYP_IV0LR_IV13		(1 << 18)
/** CRYP_IV0LR_IV14 IV14 **/
#define CRYP_IV0LR_IV14		(1 << 17)
/** CRYP_IV0LR_IV15 IV15 **/
#define CRYP_IV0LR_IV15		(1 << 16)
/** CRYP_IV0LR_IV16 IV16 **/
#define CRYP_IV0LR_IV16		(1 << 15)
/** CRYP_IV0LR_IV17 IV17 **/
#define CRYP_IV0LR_IV17		(1 << 14)
/** CRYP_IV0LR_IV18 IV18 **/
#define CRYP_IV0LR_IV18		(1 << 13)
/** CRYP_IV0LR_IV19 IV19 **/
#define CRYP_IV0LR_IV19		(1 << 12)
/** CRYP_IV0LR_IV20 IV20 **/
#define CRYP_IV0LR_IV20		(1 << 11)
/** CRYP_IV0LR_IV21 IV21 **/
#define CRYP_IV0LR_IV21		(1 << 10)
/** CRYP_IV0LR_IV22 IV22 **/
#define CRYP_IV0LR_IV22		(1 << 9)
/** CRYP_IV0LR_IV23 IV23 **/
#define CRYP_IV0LR_IV23		(1 << 8)
/** CRYP_IV0LR_IV24 IV24 **/
#define CRYP_IV0LR_IV24		(1 << 7)
/** CRYP_IV0LR_IV25 IV25 **/
#define CRYP_IV0LR_IV25		(1 << 6)
/** CRYP_IV0LR_IV26 IV26 **/
#define CRYP_IV0LR_IV26		(1 << 5)
/** CRYP_IV0LR_IV27 IV27 **/
#define CRYP_IV0LR_IV27		(1 << 4)
/** CRYP_IV0LR_IV28 IV28 **/
#define CRYP_IV0LR_IV28		(1 << 3)
/** CRYP_IV0LR_IV29 IV29 **/
#define CRYP_IV0LR_IV29		(1 << 2)
/** CRYP_IV0LR_IV30 IV30 **/
#define CRYP_IV0LR_IV30		(1 << 1)
/** CRYP_IV0LR_IV31 IV31 **/
#define CRYP_IV0LR_IV31		(1 << 0)

/**@}*/

/** @defgroup cryp_iv0rr IV0RR initialization vector registers
@{*/

