grevaillot/svd_tools/headers/STM32H753x/cryp.h
/** CRYP_IV0RR_IV32 IV32 **/
#define CRYP_IV0RR_IV32		(1 << 31)
/** CRYP_IV0RR_IV33 IV33 **/
#define CRYP_IV0RR_IV33		(1 << 30)
/** CRYP_IV0RR_IV34 IV34 **/
#define CRYP_IV0RR_IV34		(1 << 29)
/** CRYP_IV0RR_IV35 IV35 **/
#define CRYP_IV0RR_IV35		(1 << 28)
/** CRYP_IV0RR_IV36 IV36 **/
#define CRYP_IV0RR_IV36		(1 << 27)
/** CRYP_IV0RR_IV37 IV37 **/
#define CRYP_IV0RR_IV37		(1 << 26)
/** CRYP_IV0RR_IV38 IV38 **/
#define CRYP_IV0RR_IV38		(1 << 25)
/** CRYP_IV0RR_IV39 IV39 **/
#define CRYP_IV0RR_IV39		(1 << 24)
/** CRYP_IV0RR_IV40 IV40 **/
#define CRYP_IV0RR_IV40		(1 << 23)
/** CRYP_IV0RR_IV41 IV41 **/
#define CRYP_IV0RR_IV41		(1 << 22)
/** CRYP_IV0RR_IV42 IV42 **/
#define CRYP_IV0RR_IV42		(1 << 21)
/** CRYP_IV0RR_IV43 IV43 **/
#define CRYP_IV0RR_IV43		(1 << 20)
/** CRYP_IV0RR_IV44 IV44 **/
#define CRYP_IV0RR_IV44		(1 << 19)
/** CRYP_IV0RR_IV45 IV45 **/
#define CRYP_IV0RR_IV45		(1 << 18)
/** CRYP_IV0RR_IV46 IV46 **/
#define CRYP_IV0RR_IV46		(1 << 17)
/** CRYP_IV0RR_IV47 IV47 **/
#define CRYP_IV0RR_IV47		(1 << 16)
/** CRYP_IV0RR_IV48 IV48 **/
#define CRYP_IV0RR_IV48		(1 << 15)
/** CRYP_IV0RR_IV49 IV49 **/
#define CRYP_IV0RR_IV49		(1 << 14)
/** CRYP_IV0RR_IV50 IV50 **/
#define CRYP_IV0RR_IV50		(1 << 13)
/** CRYP_IV0RR_IV51 IV51 **/
#define CRYP_IV0RR_IV51		(1 << 12)
/** CRYP_IV0RR_IV52 IV52 **/
#define CRYP_IV0RR_IV52		(1 << 11)
/** CRYP_IV0RR_IV53 IV53 **/
#define CRYP_IV0RR_IV53		(1 << 10)
/** CRYP_IV0RR_IV54 IV54 **/
#define CRYP_IV0RR_IV54		(1 << 9)
/** CRYP_IV0RR_IV55 IV55 **/
#define CRYP_IV0RR_IV55		(1 << 8)
/** CRYP_IV0RR_IV56 IV56 **/
#define CRYP_IV0RR_IV56		(1 << 7)
/** CRYP_IV0RR_IV57 IV57 **/
#define CRYP_IV0RR_IV57		(1 << 6)
/** CRYP_IV0RR_IV58 IV58 **/
#define CRYP_IV0RR_IV58		(1 << 5)
/** CRYP_IV0RR_IV59 IV59 **/
#define CRYP_IV0RR_IV59		(1 << 4)
/** CRYP_IV0RR_IV60 IV60 **/
#define CRYP_IV0RR_IV60		(1 << 3)
/** CRYP_IV0RR_IV61 IV61 **/
#define CRYP_IV0RR_IV61		(1 << 2)
/** CRYP_IV0RR_IV62 IV62 **/
#define CRYP_IV0RR_IV62		(1 << 1)
/** CRYP_IV0RR_IV63 IV63 **/
#define CRYP_IV0RR_IV63		(1 << 0)

/**@}*/

/** @defgroup cryp_iv1lr IV1LR initialization vector registers
@{*/

/** CRYP_IV1LR_IV64 IV64 **/
#define CRYP_IV1LR_IV64		(1 << 31)
/** CRYP_IV1LR_IV65 IV65 **/
#define CRYP_IV1LR_IV65		(1 << 30)
/** CRYP_IV1LR_IV66 IV66 **/
#define CRYP_IV1LR_IV66		(1 << 29)
/** CRYP_IV1LR_IV67 IV67 **/
#define CRYP_IV1LR_IV67		(1 << 28)
/** CRYP_IV1LR_IV68 IV68 **/
#define CRYP_IV1LR_IV68		(1 << 27)
/** CRYP_IV1LR_IV69 IV69 **/
#define CRYP_IV1LR_IV69		(1 << 26)
/** CRYP_IV1LR_IV70 IV70 **/
#define CRYP_IV1LR_IV70		(1 << 25)
/** CRYP_IV1LR_IV71 IV71 **/
#define CRYP_IV1LR_IV71		(1 << 24)
/** CRYP_IV1LR_IV72 IV72 **/
#define CRYP_IV1LR_IV72		(1 << 23)
/** CRYP_IV1LR_IV73 IV73 **/
#define CRYP_IV1LR_IV73		(1 << 22)
/** CRYP_IV1LR_IV74 IV74 **/
#define CRYP_IV1LR_IV74		(1 << 21)
/** CRYP_IV1LR_IV75 IV75 **/
#define CRYP_IV1LR_IV75		(1 << 20)
/** CRYP_IV1LR_IV76 IV76 **/
#define CRYP_IV1LR_IV76		(1 << 19)
/** CRYP_IV1LR_IV77 IV77 **/
#define CRYP_IV1LR_IV77		(1 << 18)
/** CRYP_IV1LR_IV78 IV78 **/
#define CRYP_IV1LR_IV78		(1 << 17)
/** CRYP_IV1LR_IV79 IV79 **/
#define CRYP_IV1LR_IV79		(1 << 16)
/** CRYP_IV1LR_IV80 IV80 **/
#define CRYP_IV1LR_IV80		(1 << 15)
/** CRYP_IV1LR_IV81 IV81 **/
#define CRYP_IV1LR_IV81		(1 << 14)
/** CRYP_IV1LR_IV82 IV82 **/
#define CRYP_IV1LR_IV82		(1 << 13)
/** CRYP_IV1LR_IV83 IV83 **/
#define CRYP_IV1LR_IV83		(1 << 12)
/** CRYP_IV1LR_IV84 IV84 **/
#define CRYP_IV1LR_IV84		(1 << 11)
/** CRYP_IV1LR_IV85 IV85 **/
#define CRYP_IV1LR_IV85		(1 << 10)
/** CRYP_IV1LR_IV86 IV86 **/
#define CRYP_IV1LR_IV86		(1 << 9)
/** CRYP_IV1LR_IV87 IV87 **/
#define CRYP_IV1LR_IV87		(1 << 8)
/** CRYP_IV1LR_IV88 IV88 **/
#define CRYP_IV1LR_IV88		(1 << 7)
/** CRYP_IV1LR_IV89 IV89 **/
#define CRYP_IV1LR_IV89		(1 << 6)
/** CRYP_IV1LR_IV90 IV90 **/
#define CRYP_IV1LR_IV90		(1 << 5)
/** CRYP_IV1LR_IV91 IV91 **/
#define CRYP_IV1LR_IV91		(1 << 4)
/** CRYP_IV1LR_IV92 IV92 **/
#define CRYP_IV1LR_IV92		(1 << 3)
/** CRYP_IV1LR_IV93 IV93 **/
#define CRYP_IV1LR_IV93		(1 << 2)
/** CRYP_IV1LR_IV94 IV94 **/
#define CRYP_IV1LR_IV94		(1 << 1)
/** CRYP_IV1LR_IV95 IV95 **/
#define CRYP_IV1LR_IV95		(1 << 0)

/**@}*/

/** @defgroup cryp_iv1rr IV1RR initialization vector registers
@{*/

/** CRYP_IV1RR_IV96 IV96 **/
#define CRYP_IV1RR_IV96		(1 << 31)
/** CRYP_IV1RR_IV97 IV97 **/
#define CRYP_IV1RR_IV97		(1 << 30)
/** CRYP_IV1RR_IV98 IV98 **/
#define CRYP_IV1RR_IV98		(1 << 29)
/** CRYP_IV1RR_IV99 IV99 **/
#define CRYP_IV1RR_IV99		(1 << 28)
/** CRYP_IV1RR_IV100 IV100 **/
#define CRYP_IV1RR_IV100		(1 << 27)
/** CRYP_IV1RR_IV101 IV101 **/
#define CRYP_IV1RR_IV101		(1 << 26)
/** CRYP_IV1RR_IV102 IV102 **/
#define CRYP_IV1RR_IV102		(1 << 25)
/** CRYP_IV1RR_IV103 IV103 **/
#define CRYP_IV1RR_IV103		(1 << 24)
/** CRYP_IV1RR_IV104 IV104 **/
#define CRYP_IV1RR_IV104		(1 << 23)
/** CRYP_IV1RR_IV105 IV105 **/
#define CRYP_IV1RR_IV105		(1 << 22)
/** CRYP_IV1RR_IV106 IV106 **/
#define CRYP_IV1RR_IV106		(1 << 21)
/** CRYP_IV1RR_IV107 IV107 **/
#define CRYP_IV1RR_IV107		(1 << 20)
/** CRYP_IV1RR_IV108 IV108 **/
#define CRYP_IV1RR_IV108		(1 << 19)
/** CRYP_IV1RR_IV109 IV109 **/
#define CRYP_IV1RR_IV109		(1 << 18)
/** CRYP_IV1RR_IV110 IV110 **/
#define CRYP_IV1RR_IV110		(1 << 17)
/** CRYP_IV1RR_IV111 IV111 **/
#define CRYP_IV1RR_IV111		(1 << 16)
/** CRYP_IV1RR_IV112 IV112 **/
#define CRYP_IV1RR_IV112		(1 << 15)
/** CRYP_IV1RR_IV113 IV113 **/
#define CRYP_IV1RR_IV113		(1 << 14)
/** CRYP_IV1RR_IV114 IV114 **/
#define CRYP_IV1RR_IV114		(1 << 13)
/** CRYP_IV1RR_IV115 IV115 **/
#define CRYP_IV1RR_IV115		(1 << 12)
/** CRYP_IV1RR_IV116 IV116 **/
#define CRYP_IV1RR_IV116		(1 << 11)
/** CRYP_IV1RR_IV117 IV117 **/
#define CRYP_IV1RR_IV117		(1 << 10)
/** CRYP_IV1RR_IV118 IV118 **/
#define CRYP_IV1RR_IV118		(1 << 9)
/** CRYP_IV1RR_IV119 IV119 **/
#define CRYP_IV1RR_IV119		(1 << 8)
/** CRYP_IV1RR_IV120 IV120 **/
#define CRYP_IV1RR_IV120		(1 << 7)
/** CRYP_IV1RR_IV121 IV121 **/
#define CRYP_IV1RR_IV121		(1 << 6)
/** CRYP_IV1RR_IV122 IV122 **/
#define CRYP_IV1RR_IV122		(1 << 5)
/** CRYP_IV1RR_IV123 IV123 **/
#define CRYP_IV1RR_IV123		(1 << 4)
/** CRYP_IV1RR_IV124 IV124 **/
#define CRYP_IV1RR_IV124		(1 << 3)
/** CRYP_IV1RR_IV125 IV125 **/
#define CRYP_IV1RR_IV125		(1 << 2)
/** CRYP_IV1RR_IV126 IV126 **/
#define CRYP_IV1RR_IV126		(1 << 1)
/** CRYP_IV1RR_IV127 IV127 **/
#define CRYP_IV1RR_IV127		(1 << 0)

/**@}*/

/** @defgroup cryp_csgcmccm0r CSGCMCCM0R context swap register
@{*/


