grevaillot/svd_tools/headers/STM32H753x/cryp.h
#define CRYP_CSGCMCCM0R_CSGCMCCM0_SHIFT		0
#define CRYP_CSGCMCCM0R_CSGCMCCM0_MASK		0xffffffff
/** @defgroup cryp_csgcmccm0r_csgcmccm0 CSGCMCCM0 CSGCMCCM0
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm1r CSGCMCCM1R context swap register
@{*/


#define CRYP_CSGCMCCM1R_CSGCMCCM1_SHIFT		0
#define CRYP_CSGCMCCM1R_CSGCMCCM1_MASK		0xffffffff
/** @defgroup cryp_csgcmccm1r_csgcmccm1 CSGCMCCM1 CSGCMCCM1
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm2r CSGCMCCM2R context swap register
@{*/


#define CRYP_CSGCMCCM2R_CSGCMCCM2_SHIFT		0
#define CRYP_CSGCMCCM2R_CSGCMCCM2_MASK		0xffffffff
/** @defgroup cryp_csgcmccm2r_csgcmccm2 CSGCMCCM2 CSGCMCCM2
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm3r CSGCMCCM3R context swap register
@{*/


#define CRYP_CSGCMCCM3R_CSGCMCCM3_SHIFT		0
#define CRYP_CSGCMCCM3R_CSGCMCCM3_MASK		0xffffffff
/** @defgroup cryp_csgcmccm3r_csgcmccm3 CSGCMCCM3 CSGCMCCM3
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm4r CSGCMCCM4R context swap register
@{*/


#define CRYP_CSGCMCCM4R_CSGCMCCM4_SHIFT		0
#define CRYP_CSGCMCCM4R_CSGCMCCM4_MASK		0xffffffff
/** @defgroup cryp_csgcmccm4r_csgcmccm4 CSGCMCCM4 CSGCMCCM4
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm5r CSGCMCCM5R context swap register
@{*/


#define CRYP_CSGCMCCM5R_CSGCMCCM5_SHIFT		0
#define CRYP_CSGCMCCM5R_CSGCMCCM5_MASK		0xffffffff
/** @defgroup cryp_csgcmccm5r_csgcmccm5 CSGCMCCM5 CSGCMCCM5
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm6r CSGCMCCM6R context swap register
@{*/


#define CRYP_CSGCMCCM6R_CSGCMCCM6_SHIFT		0
#define CRYP_CSGCMCCM6R_CSGCMCCM6_MASK		0xffffffff
/** @defgroup cryp_csgcmccm6r_csgcmccm6 CSGCMCCM6 CSGCMCCM6
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcmccm7r CSGCMCCM7R context swap register
@{*/


#define CRYP_CSGCMCCM7R_CSGCMCCM7_SHIFT		0
#define CRYP_CSGCMCCM7R_CSGCMCCM7_MASK		0xffffffff
/** @defgroup cryp_csgcmccm7r_csgcmccm7 CSGCMCCM7 CSGCMCCM7
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm0r CSGCM0R context swap register
@{*/


#define CRYP_CSGCM0R_CSGCM0_SHIFT		0
#define CRYP_CSGCM0R_CSGCM0_MASK		0xffffffff
/** @defgroup cryp_csgcm0r_csgcm0 CSGCM0 CSGCM0
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm1r CSGCM1R context swap register
@{*/


#define CRYP_CSGCM1R_CSGCM1_SHIFT		0
#define CRYP_CSGCM1R_CSGCM1_MASK		0xffffffff
/** @defgroup cryp_csgcm1r_csgcm1 CSGCM1 CSGCM1
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm2r CSGCM2R context swap register
@{*/


#define CRYP_CSGCM2R_CSGCM2_SHIFT		0
#define CRYP_CSGCM2R_CSGCM2_MASK		0xffffffff
/** @defgroup cryp_csgcm2r_csgcm2 CSGCM2 CSGCM2
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm3r CSGCM3R context swap register
@{*/


#define CRYP_CSGCM3R_CSGCM3_SHIFT		0
#define CRYP_CSGCM3R_CSGCM3_MASK		0xffffffff
/** @defgroup cryp_csgcm3r_csgcm3 CSGCM3 CSGCM3
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm4r CSGCM4R context swap register
@{*/


#define CRYP_CSGCM4R_CSGCM4_SHIFT		0
#define CRYP_CSGCM4R_CSGCM4_MASK		0xffffffff
/** @defgroup cryp_csgcm4r_csgcm4 CSGCM4 CSGCM4
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm5r CSGCM5R context swap register
@{*/


#define CRYP_CSGCM5R_CSGCM5_SHIFT		0
#define CRYP_CSGCM5R_CSGCM5_MASK		0xffffffff
/** @defgroup cryp_csgcm5r_csgcm5 CSGCM5 CSGCM5
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm6r CSGCM6R context swap register
@{*/


#define CRYP_CSGCM6R_CSGCM6_SHIFT		0
#define CRYP_CSGCM6R_CSGCM6_MASK		0xffffffff
/** @defgroup cryp_csgcm6r_csgcm6 CSGCM6 CSGCM6
@{*/
/**@}*/


/**@}*/

/** @defgroup cryp_csgcm7r CSGCM7R context swap register
@{*/


#define CRYP_CSGCM7R_CSGCM7_SHIFT		0
#define CRYP_CSGCM7R_CSGCM7_MASK		0xffffffff
/** @defgroup cryp_csgcm7r_csgcm7 CSGCM7 CSGCM7
@{*/
/**@}*/


/**@}*/
